Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.hosts_templatefile will be created
+ resource "local_file" "hosts_templatefile" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/atlantis-data/repos/vakhtanov/netology-diploma-terraform-stage2/4/default/../03_ansible_kubernetes/inventory.ini"
      + id                   = (known after apply)
    }

  # local_file.parameters_templatefile will be created
+ resource "local_file" "parameters_templatefile" {
      + content              = <<-EOT
            {
                "helm_enabled" : true,
                "ingress_nginx_enabled" : true,
                "cluster_name" : "cluster.local",
                "kubectl_localhost" : true,
                "kubeconfig_localhost" : true,
                "persistent_volumes_enabled" : true,
                "dashboard_enabled" : true,
            }
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/atlantis-data/repos/vakhtanov/netology-diploma-terraform-stage2/4/default/../03_ansible_kubernetes/parameters.json"
      + id                   = (known after apply)
    }

  # yandex_compute_instance.control_node[0] must be replaced
-/+ resource "yandex_compute_instance" "control_node" {
      ~ created_at                = "2025-12-01T16:46:55Z" -> (known after apply)
      ~ folder_id                 = "b1g0jl4hsmsh89fu01vr" -> (known after apply)
      ~ fqdn                      = "fhmupovgs0ddcqej0hg5.auto.internal" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ hardware_generation       = [
          - {
              - generation2_features = []
              - legacy_features      = [
                  - {
                      - pci_topology = "PCI_TOPOLOGY_V1"
                    },
                ]
            },
        ] -> (known after apply)
      + hostname                  = "control-node-subnet-a" # forces replacement
      ~ id                        = "fhmupovgs0ddcqej0hg5" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "control-node-subnet-a"
      ~ status                    = "running" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "fhmtefcugbu6q99fehk8" -> (known after apply)
          ~ disk_id     = "fhmtefcugbu6q99fehk8" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
              + name        = (known after apply)
              + snapshot_id = (known after apply)
                # (4 unchanged attributes hidden)
            }
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ip_address         = "192.168.10.18" -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:1e:ce:3f:0e" -> (known after apply)
          ~ nat_ip_address     = "89.169.152.201" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          - security_group_ids = [] -> null
            # (3 unchanged attributes hidden)
        }

      ~ placement_policy (known after apply)
      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # yandex_compute_instance.control_node[1] must be replaced
-/+ resource "yandex_compute_instance" "control_node" {
      ~ created_at                = "2025-12-01T16:46:54Z" -> (known after apply)
      ~ folder_id                 = "b1g0jl4hsmsh89fu01vr" -> (known after apply)
      ~ fqdn                      = "epdgavljp8kkkibjvho3.auto.internal" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ hardware_generation       = [
          - {
              - generation2_features = []
              - legacy_features      = [
                  - {
                      - pci_topology = "PCI_TOPOLOGY_V1"
                    },
                ]
            },
        ] -> (known after apply)
      + hostname                  = "control-node-subnet-b" # forces replacement
      ~ id                        = "epdgavljp8kkkibjvho3" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "control-node-subnet-b"
      ~ status                    = "running" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "epd4uvhljq0g8dn32vt1" -> (known after apply)
          ~ disk_id     = "epd4uvhljq0g8dn32vt1" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
              + name        = (known after apply)
              + snapshot_id = (known after apply)
                # (4 unchanged attributes hidden)
            }
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ip_address         = "192.168.20.13" -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:10:57:eb:3c" -> (known after apply)
          ~ nat_ip_address     = "89.169.191.12" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          - security_group_ids = [] -> null
            # (3 unchanged attributes hidden)
        }

      ~ placement_policy (known after apply)
      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # yandex_compute_instance.control_node[2] must be replaced
-/+ resource "yandex_compute_instance" "control_node" {
      ~ created_at                = "2025-12-01T16:46:55Z" -> (known after apply)
      ~ folder_id                 = "b1g0jl4hsmsh89fu01vr" -> (known after apply)
      ~ fqdn                      = "fv4o02ts15qv0iv75dcj.auto.internal" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ hardware_generation       = [
          - {
              - generation2_features = []
              - legacy_features      = [
                  - {
                      - pci_topology = "PCI_TOPOLOGY_V1"
                    },
                ]
            },
        ] -> (known after apply)
      + hostname                  = "control-node-subnet-d" # forces replacement
      ~ id                        = "fv4o02ts15qv0iv75dcj" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "control-node-subnet-d"
      ~ status                    = "running" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "fv41kpgrololfbacb8ub" -> (known after apply)
          ~ disk_id     = "fv41kpgrololfbacb8ub" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
              + name        = (known after apply)
              + snapshot_id = (known after apply)
                # (4 unchanged attributes hidden)
            }
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ip_address         = "192.168.30.25" -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:18:00:bb:c0" -> (known after apply)
          ~ nat_ip_address     = "130.193.56.29" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          - security_group_ids = [] -> null
            # (3 unchanged attributes hidden)
        }

      ~ placement_policy (known after apply)
      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # yandex_compute_instance.test_vm[0] must be replaced
-/+ resource "yandex_compute_instance" "test_vm" {
      ~ created_at                = "2025-12-02T22:08:04Z" -> (known after apply)
      ~ folder_id                 = "b1g0jl4hsmsh89fu01vr" -> (known after apply)
      ~ fqdn                      = "fhmhgl3mak0rfi3gc3v9.auto.internal" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ hardware_generation       = [
          - {
              - generation2_features = []
              - legacy_features      = [
                  - {
                      - pci_topology = "PCI_TOPOLOGY_V2"
                    },
                ]
            },
        ] -> (known after apply)
      + hostname                  = "test-vm" # forces replacement
      ~ id                        = "fhmhgl3mak0rfi3gc3v9" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "test-vm"
      ~ status                    = "running" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "fhm5tcfvu7ma3019jf6u" -> (known after apply)
          ~ disk_id     = "fhm5tcfvu7ma3019jf6u" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
              + name        = (known after apply)
              + snapshot_id = (known after apply)
                # (4 unchanged attributes hidden)
            }
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ip_address         = "192.168.100.15" -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:11:85:47:65" -> (known after apply)
          ~ nat_ip_address     = "89.169.137.102" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          - security_group_ids = [] -> null
            # (3 unchanged attributes hidden)
        }

      ~ placement_policy (known after apply)
      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # yandex_compute_instance.worker_node[0] must be replaced
-/+ resource "yandex_compute_instance" "worker_node" {
      ~ created_at                = "2025-12-01T16:49:04Z" -> (known after apply)
      ~ folder_id                 = "b1g0jl4hsmsh89fu01vr" -> (known after apply)
      ~ fqdn                      = "fhmpt1okqjvp308lrgqi.auto.internal" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ hardware_generation       = [
          - {
              - generation2_features = []
              - legacy_features      = [
                  - {
                      - pci_topology = "PCI_TOPOLOGY_V1"
                    },
                ]
            },
        ] -> (known after apply)
      + hostname                  = "worker-node-1" # forces replacement
      ~ id                        = "fhmpt1okqjvp308lrgqi" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "worker-node-1"
      ~ status                    = "running" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "fhmmegepig9cpk4j89sb" -> (known after apply)
          ~ disk_id     = "fhmmegepig9cpk4j89sb" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
              + name        = (known after apply)
              + snapshot_id = (known after apply)
                # (4 unchanged attributes hidden)
            }
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ip_address         = "192.168.10.35" -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:19:e8:71:4d" -> (known after apply)
          ~ nat_ip_address     = "89.169.155.159" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          - security_group_ids = [] -> null
            # (3 unchanged attributes hidden)
        }

      ~ placement_policy (known after apply)
      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # yandex_compute_instance.worker_node[1] must be replaced
-/+ resource "yandex_compute_instance" "worker_node" {
      ~ created_at                = "2025-12-01T16:49:04Z" -> (known after apply)
      ~ folder_id                 = "b1g0jl4hsmsh89fu01vr" -> (known after apply)
      ~ fqdn                      = "epdm31g7u34fqjhonnm6.auto.internal" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ hardware_generation       = [
          - {
              - generation2_features = []
              - legacy_features      = [
                  - {
                      - pci_topology = "PCI_TOPOLOGY_V1"
                    },
                ]
            },
        ] -> (known after apply)
      + hostname                  = "worker-node-2" # forces replacement
      ~ id                        = "epdm31g7u34fqjhonnm6" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "worker-node-2"
      ~ status                    = "running" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "epddp52ap0hsc5er2eie" -> (known after apply)
          ~ disk_id     = "epddp52ap0hsc5er2eie" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
              + name        = (known after apply)
              + snapshot_id = (known after apply)
                # (4 unchanged attributes hidden)
            }
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ip_address         = "192.168.20.19" -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:16:18:60:7f" -> (known after apply)
          ~ nat_ip_address     = "89.169.191.80" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          - security_group_ids = [] -> null
            # (3 unchanged attributes hidden)
        }

      ~ placement_policy (known after apply)
      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 0 to change, 6 to destroy.

Changes to Outputs:
~ control_node_info = [
      ~ {
          ~ external_ip   = "89.169.152.201" -> (known after apply)
          ~ fqdn          = "fhmupovgs0ddcqej0hg5.auto.internal" -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ external_ip   = "89.169.191.12" -> (known after apply)
          ~ fqdn          = "epdgavljp8kkkibjvho3.auto.internal" -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ external_ip   = "130.193.56.29" -> (known after apply)
          ~ fqdn          = "fv4o02ts15qv0iv75dcj.auto.internal" -> (known after apply)
            # (1 unchanged attribute hidden)
        },
    ]
~ manage_vm         = [
      ~ {
          ~ external_ip   = "89.169.155.159" -> (known after apply)
          ~ fqdn          = "fhmpt1okqjvp308lrgqi.auto.internal" -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ external_ip   = "89.169.191.80" -> (known after apply)
          ~ fqdn          = "epdm31g7u34fqjhonnm6.auto.internal" -> (known after apply)
            # (1 unchanged attribute hidden)
        },
    ]
~ worker_node_info  = [
      ~ {
          ~ external_ip   = "89.169.155.159" -> (known after apply)
          ~ fqdn          = "fhmpt1okqjvp308lrgqi.auto.internal" -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ external_ip   = "89.169.191.80" -> (known after apply)
          ~ fqdn          = "epdm31g7u34fqjhonnm6.auto.internal" -> (known after apply)
            # (1 unchanged attribute hidden)
        },
    ]
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=vakhtanov%252Fnetology-diploma-terraform-stage2%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 8 to add, 0 to change, 6 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```